#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {altera_reserved_tck} -period 100.000 -waveform { 0.000 50.000 } [get_ports {altera_reserved_tck}]
create_clock -name {RMII_REFCLK} -period 20.000 -waveform { 0.000 10.000 } [get_ports {RMII_REFCLK}]
create_clock -name {ULPI_CLOCK} -period 16.000 -waveform { 0.000 8.000 } [get_ports {ULPI_CLOCK}]
create_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture} -period 8.000 -waveform { 0.000 4.000 } [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[*].dq[*].dqi|auto_generated|input_cell_*[0]|clk}] -add
create_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic} -period 8.000 -waveform { 0.000 4.000 } [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|DDR_CLK_OUT[0].ddr_clk_out_p|auto_generated|input_cell_h[0]|clk}]
create_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_SDRAM_CLK_mimic_launch_clock} -period 8.000 -waveform { 0.000 4.000 } [get_ports {SDRAM_CLK}] -add


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 4 -master_clock {RMII_REFCLK} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] 
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 2 -master_clock {RMII_REFCLK} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] 
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 2 -phase -90.000 -master_clock {RMII_REFCLK} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] 
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 2 -master_clock {RMII_REFCLK} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] 
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 5 -divide_by 2 -master_clock {RMII_REFCLK} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] 
create_generated_clock -name {i_pll|altpll_component|auto_generated|pll1|clk[0]} -source [get_pins {i_pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 12 -divide_by 25 -master_clock {RMII_REFCLK} [get_pins {i_pll|altpll_component|auto_generated|pll1|clk[0]}] 
create_generated_clock -name {i_pll|altpll_component|auto_generated|pll1|clk[1]} -source [get_pins {i_pll|altpll_component|auto_generated|pll1|inclk[0]}] -duty_cycle 50.000 -multiply_by 12 -divide_by 49 -master_clock {RMII_REFCLK} [get_pins {i_pll|altpll_component|auto_generated|pll1|clk[1]}] 
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} [get_ports {SDRAM_CLK}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} [get_ports {SDRAM_CLK}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_rise} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} [get_ports {SDRAM_CLK}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} [get_ports {SDRAM_CLK}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} -invert [get_ports {SDRAM_CLKn}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} -invert [get_ports {SDRAM_CLKn}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_rise} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} -invert [get_ports {SDRAM_CLKn}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} -invert [get_ports {SDRAM_CLKn}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[7].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[6].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[5].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[4].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[3].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[2].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[1].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[0].dqi|auto_generated|input_cell_h[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[7].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[6].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[5].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[4].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[3].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[2].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[1].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16} -source [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[0].dq[0].dqi|auto_generated|input_cell_l[0]|clk}] -add
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -divide_by 2 -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]} [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q}] 
create_generated_clock -name {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS} -source [get_pins {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -master_clock {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]} [get_ports {SDRAM_DQS}] 


#**************************************************************
# USB timing
#**************************************************************
    
# Set Input Delay
set_input_delay -add_delay -clock [get_clocks ULPI_CLOCK] -max 1.5 [get_ports -no_case "ULPI_DATA* ULPI_DIR ULPI_NXT"]
set_input_delay -add_delay -clock [get_clocks ULPI_CLOCK] -min 3.5 [get_ports -no_case "ULPI_DATA* ULPI_DIR ULPI_NXT"]

# Set Output Delay
# max output delay (measured from next clock edge) = set_up of other device.
set_output_delay -add_delay -max -clock [get_clocks ULPI_CLOCK]  5.0 [get_ports -no_case "ULPI_DATA* ULPI_STP"]
set_output_delay -add_delay -min -clock [get_clocks ULPI_CLOCK]  0   [get_ports -no_case "ULPI_DATA* ULPI_STP"]

# Set a multicycle path on the bus turnaround
# set_multicycle_path -setup -end -from [get_keepers -no_case "ULPI_DIR"] -to [get_keepers -no_case "ULPI_DATA*"] 2
# set_multicycle_path -hold -end -from [get_keepers -no_case "ULPI_DIR"] -to [get_keepers -no_case "ULPI_DATA*"] 2


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  0.000  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  0.000  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  0.000  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  0.000  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -setup 0.090  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -setup 0.090  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -setup 0.090  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -setup 0.090  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  0.110  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  0.110  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -setup 0.090  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -setup 0.090  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -setup 0.090  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -setup 0.090  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_pll|altpll_component|auto_generated|pll1|clk[1]}]  0.150  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {RMII_REFCLK}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -setup 0.060  
set_clock_uncertainty -rise_from [get_clocks {RMII_REFCLK}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -hold 0.090  
set_clock_uncertainty -rise_from [get_clocks {RMII_REFCLK}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -setup 0.060  
set_clock_uncertainty -rise_from [get_clocks {RMII_REFCLK}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -hold 0.090  
set_clock_uncertainty -fall_from [get_clocks {RMII_REFCLK}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -setup 0.060  
set_clock_uncertainty -fall_from [get_clocks {RMII_REFCLK}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -hold 0.090  
set_clock_uncertainty -fall_from [get_clocks {RMII_REFCLK}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -setup 0.060  
set_clock_uncertainty -fall_from [get_clocks {RMII_REFCLK}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -hold 0.090  
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.030  
set_clock_uncertainty -rise_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.030  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  0.020  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -rise_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.030  
set_clock_uncertainty -fall_from [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -fall_to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  0.030  


#**************************************************************
# Set Input Delay
#**************************************************************



#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[0]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[0]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[0]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[0]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[1]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[1]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[1]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[1]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[2]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[2]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[2]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[2]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[3]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[3]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[3]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[3]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[4]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[4]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[4]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[4]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[5]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[5]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[5]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[5]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[6]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[6]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[6]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[6]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[7]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[7]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[7]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[7]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[8]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[8]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[8]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[8]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[9]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[9]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[9]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[9]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[10]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[10]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[10]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[10]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[11]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[11]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[11]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[11]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[12]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[12]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[12]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[12]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_A[13]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_A[13]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_A[13]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_A[13]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_BA[0]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_BA[0]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_BA[0]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_BA[0]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_BA[1]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_BA[1]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_BA[1]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_BA[1]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_CASn}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_CASn}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_CASn}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_CASn}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_CKE}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_CKE}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_CKE}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_CKE}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_CSn}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_CSn}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_CSn}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_CSn}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DM}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DM}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DM}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DM}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  6.020 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  1.980 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  1.620 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  -1.620 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  6.020 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  1.980 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  1.620 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  -1.620 [get_ports {SDRAM_DQS}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[0]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[0]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[0]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[0]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[1]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[1]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[1]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[1]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[2]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[2]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[2]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[2]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[3]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[3]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[3]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[3]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[4]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[4]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[4]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[4]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[5]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[5]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[5]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[5]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[6]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[6]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[6]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[6]}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[7]}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[7]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  1.080 [get_ports {SDRAM_DQ[7]}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_dqsout_SDRAM_DQS}]  -0.751 [get_ports {SDRAM_DQ[7]}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_ODT}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_ODT}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_ODT}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_ODT}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_RASn}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_RASn}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_RASn}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_RASn}]
set_output_delay -add_delay -max -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  0.520 [get_ports {SDRAM_WEn}]
set_output_delay -add_delay -min -clock_fall -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -0.520 [get_ports {SDRAM_WEn}]
set_output_delay -add_delay -max -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  0.520 [get_ports {SDRAM_WEn}]
set_output_delay -add_delay -min -clock [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -0.520 [get_ports {SDRAM_WEn}]


#**************************************************************
# Set Clock Groups
#**************************************************************

set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 


#**************************************************************
# Set False Path
#**************************************************************

set_false_path  -to  [get_keepers {*synchroniser:*_tig*}]
set_false_path  -to  [get_keepers {*level_synchronizer:*|sync1}]

set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  -to  [get_clocks {RMII_REFCLK}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_capture}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[4]}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_rise}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_rise}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ddr_mimic}]
set_false_path  -fall_from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDQSS}]
set_false_path  -fall_from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDQSS}]
set_false_path  -rise_from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_tDSS}]
set_false_path  -rise_from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[1]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_tDSS}]
set_false_path  -rise_from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_p_SDRAM_CLK_ac_fall}]
set_false_path  -rise_from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[2]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_ck_n_SDRAM_CLKn_ac_fall}]
set_false_path -to [get_keepers {*altera_std_synchronizer:*|din_s1}]
set_false_path -from [get_keepers {**}] -to [get_keepers {*phasedone_state*}]
set_false_path -from [get_keepers {**}] -to [get_keepers {*internal_phasestep*}]
set_false_path -to [get_pins -nocase -compatibility_mode {*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain*|clrn}]
set_false_path -from [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_nios2_oci_break:the_nios_nios2_gen2_0_cpu_nios2_oci_break|break_readreg*}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_tck:the_nios_nios2_gen2_0_cpu_debug_slave_tck|*sr*}]
set_false_path -from [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_nios2_oci_debug:the_nios_nios2_gen2_0_cpu_nios2_oci_debug|*resetlatch}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_tck:the_nios_nios2_gen2_0_cpu_debug_slave_tck|*sr[33]}]
set_false_path -from [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_nios2_oci_debug:the_nios_nios2_gen2_0_cpu_nios2_oci_debug|monitor_ready}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_tck:the_nios_nios2_gen2_0_cpu_debug_slave_tck|*sr[0]}]
set_false_path -from [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_nios2_oci_debug:the_nios_nios2_gen2_0_cpu_nios2_oci_debug|monitor_error}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_tck:the_nios_nios2_gen2_0_cpu_debug_slave_tck|*sr[34]}]
set_false_path -from [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_nios2_ocimem:the_nios_nios2_gen2_0_cpu_nios2_ocimem|*MonDReg*}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_tck:the_nios_nios2_gen2_0_cpu_debug_slave_tck|*sr*}]
set_false_path -from [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_tck:the_nios_nios2_gen2_0_cpu_debug_slave_tck|*sr*}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_sysclk:the_nios_nios2_gen2_0_cpu_debug_slave_sysclk|*jdo*}]
set_false_path -from [get_keepers {sld_hub:*|irf_reg*}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_debug_slave_wrapper:the_nios_nios2_gen2_0_cpu_debug_slave_wrapper|nios_nios2_gen2_0_cpu_debug_slave_sysclk:the_nios_nios2_gen2_0_cpu_debug_slave_sysclk|ir*}]
set_false_path -from [get_keepers {sld_hub:*|sld_shadow_jsm:shadow_jsm|state[1]}] -to [get_keepers {*nios_nios2_gen2_0_cpu:*|nios_nios2_gen2_0_cpu_nios2_oci:the_nios_nios2_gen2_0_cpu_nios2_oci|nios_nios2_gen2_0_cpu_nios2_oci_debug:the_nios_nios2_gen2_0_cpu_nios2_oci_debug|monitor_go}]
set_false_path -from [get_clocks *] -to [get_ports {SDRAM_CLK}]
set_false_path -from [get_clocks *] -to [get_ports {SDRAM_CLKn}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_1}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_2}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_3}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_4}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_5}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_6}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_7}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_8}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_9}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_10}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_11}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_12}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_13}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_14}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_15}]
set_false_path -from [get_ports *] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_dq_16}]
set_false_path -from [all_registers] -to [get_ports {SDRAM_DQS}]
set_false_path -from [get_keepers {{SDRAM_DQ[0]} {SDRAM_DQ[1]} {SDRAM_DQ[2]} {SDRAM_DQ[3]} {SDRAM_DQ[4]} {SDRAM_DQ[5]} {SDRAM_DQ[6]} {SDRAM_DQ[7]}}] -to [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[3]}]
set_false_path -to [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|dpio|dqs_group[*].dq[*].dqi|auto_generated|input_*_*[0]|clrn}]
set_false_path -from [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|*seq_wrapper|*seq_inst|*dgrb|?d_lat*|clk}] 
set_false_path -from [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|*seq_wrapper|*seq_inst|seq_mem_clk_disable*}] 
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|*pll|altpll_component|auto_generated|pll_lock_sync|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|global_pre_clear|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|reset_master_ams|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|mem_clk_pipe|ams_pipe[*]|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|write_clk_pipe|ams_pipe[*]|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|measure_clk_pipe|ams_pipe[*]|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|resync_clk_pipe|ams_pipe[*]|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|clk_div_reset_ams_n_r|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|clk_div_reset_ams_n|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll_reconfig_reset_ams_n_r|clrn}] -to [get_clocks *]
set_false_path -from [get_clocks *] -through [get_pins -compatibility_mode {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll_reconfig_reset_ams_n|clrn}] -to [get_clocks *]
set_false_path -from [get_pins -compatibility_mode {*_alt_mem_phy_inst|*seq_wrapper|*seq_inst|*|seq_mmc_start*|*}] -to [get_keepers {*alt_mem_phy_mimic:mmc|seq_mmc_start_metastable*}]
set_false_path -from [get_keepers {*_alt_mem_phy_inst|*seq_wrapper|*seq_inst|seq_ac_add_1t_ac_lat_internal*}] 
set_false_path -from [get_pins -compatibility_mode {*_alt_mem_phy_inst|*mmc|mimic_done_out*}] -to [get_keepers {*_alt_mem_phy_inst|*seq_wrapper|*seq_inst|*dgrb|*v_mmc_seq_done_1r*}]
set_false_path -from [all_registers] -to [get_keepers {SDRAM_CKE SDRAM_ODT SDRAM_CSn {SDRAM_A[0]} {SDRAM_A[10]} {SDRAM_A[11]} {SDRAM_A[12]} {SDRAM_A[13]} {SDRAM_A[1]} {SDRAM_A[2]} {SDRAM_A[3]} {SDRAM_A[4]} {SDRAM_A[5]} {SDRAM_A[6]} {SDRAM_A[7]} {SDRAM_A[8]} {SDRAM_A[9]} {SDRAM_BA[0]} {SDRAM_BA[1]} SDRAM_CASn SDRAM_RASn SDRAM_WEn}]

set_false_path -from [get_keepers {nios:i_nios|nios_pio_0:pio_0|data_out[15]}] -to [get_keepers {\b_audio:stream_in_*}]


#**************************************************************
# Set Multicycle Path
#**************************************************************

set_multicycle_path -setup -end -to [get_keepers {{SDRAM_A[0]} {SDRAM_A[10]} {SDRAM_A[11]} {SDRAM_A[12]} {SDRAM_A[13]} {SDRAM_A[1]} {SDRAM_A[2]} {SDRAM_A[3]} {SDRAM_A[4]} {SDRAM_A[5]} {SDRAM_A[6]} {SDRAM_A[7]} {SDRAM_A[8]} {SDRAM_A[9]} {SDRAM_BA[0]} {SDRAM_BA[1]} SDRAM_CASn SDRAM_RASn SDRAM_WEn}] 2
set_multicycle_path -hold -end -to [get_keepers {{SDRAM_A[0]} {SDRAM_A[10]} {SDRAM_A[11]} {SDRAM_A[12]} {SDRAM_A[13]} {SDRAM_A[1]} {SDRAM_A[2]} {SDRAM_A[3]} {SDRAM_A[4]} {SDRAM_A[5]} {SDRAM_A[6]} {SDRAM_A[7]} {SDRAM_A[8]} {SDRAM_A[9]} {SDRAM_BA[0]} {SDRAM_BA[1]} SDRAM_CASn SDRAM_RASn SDRAM_WEn}] 1


#**************************************************************
# Set Maximum Delay
#**************************************************************

set_max_delay -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] 9.000
set_max_delay -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] 9.000
set_max_delay -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_SDRAM_CLK_mimic_launch_clock}]  -to  [get_clocks {*ddr_mimic}] 2.500
set_max_delay -from [get_keepers {{SDRAM_DQ[0]} {SDRAM_DQ[1]} {SDRAM_DQ[2]} {SDRAM_DQ[3]} {SDRAM_DQ[4]} {SDRAM_DQ[5]} {SDRAM_DQ[6]} {SDRAM_DQ[7]}}] -to [all_registers] 4.000


#**************************************************************
# Set Minimum Delay
#**************************************************************

set_min_delay -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}] -9.000
set_min_delay -from  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|pll|altpll_component|auto_generated|pll1|clk[0]}]  -to  [get_clocks {i_nios|altmemddr_0|nios_altmemddr_0_controller_phy_inst|nios_altmemddr_0_phy_inst|nios_altmemddr_0_phy_alt_mem_phy_inst|clk|scan_clk|q_clock}] -9.000
set_min_delay -from [get_keepers {{SDRAM_DQ[0]} {SDRAM_DQ[1]} {SDRAM_DQ[2]} {SDRAM_DQ[3]} {SDRAM_DQ[4]} {SDRAM_DQ[5]} {SDRAM_DQ[6]} {SDRAM_DQ[7]}}] -to [all_registers] 0.000


#**************************************************************
# Set Input Transition
#**************************************************************

